SUS/app/controllers/internacaos_controller.rb

SELECT "internacaos".* FROM "internacaos"
---
  def index
    @internacaos = Internacao.all