SUS/app/controllers/pacientes_controller.rb

SELECT "pacientes".* FROM "pacientes"
---
  def index
    @pacientes = Paciente.all

INSERT INTO "pacientes" ("codigo", "created_at", "idade", "nome", "updated_at") VALUES (?, ?, ?, ?, ?)  [["codigo", "2"], ["created_at", Tue, 11 Mar 2014 04:26:11 UTC +00:00], ["idade", "30"], ["nome", "Diego"], ["updated_at", Tue, 11 Mar 2014 04:26:11 UTC +00:00]]
---
  def create
    @paciente = Paciente.new(paciente_params)

    respond_to do |format|
      if @paciente.save

DELETE FROM "pacientes" WHERE "pacientes"."id" = ?  [["id", 1]]
---
  def destroy
    @paciente.destroy

SELECT "pacientes".* FROM "pacientes" WHERE "pacientes"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_paciente
      @paciente = Paciente.find(params[:id])